)ATTR
  * TYPE(TEXT) COLOR(WHITE) INTENS(HIGH)
  ! TYPE(INPUT) COLOR(YELLOW) INTENS(HIGH)
  # TYPE(TEXT) COLOR(GREEN) INTENS(HIGH)
)BODY WINDOW(70,15)
*                 FUNCTION   FILE OPERATIONS
*
*       SELECT YOUR CHOICE AS PER THE LIST
*
*       1   SEARCHING AND REPLACE A STRING IN A FILE
*
*       2   COPY THE CONTENTS OF A FILE
*
*       3   TERMINATE
*
*
#       ENTER YOUR CHOICE :!Z
*
)INIT
.ZVARS='(CHOICE)'
)PROC
&KEYPRESS=.PFKEY
VPUT (CHOICE,KEYPRESS) ASIS
)END
