)ATTR
* TYPE(TEXT) COLOR(WHITE) INTENS(HIGH)
_ TYPE(INPUT) COLOR(YELLOW) INTENS(HIGH)
# TYPE(TEXT) COLOR(GREEN) INTENS(HIGH)
)BODY WINDOW(70,10)
*                 FUNCTION:   SEARCH
*
*       ENTER SEARCH DATASET:_Z
*       ENTER SEARCH WORD   :_Z
*
*
*       STATUS              :&MESSAGE
*
*
)INIT
.ZVARS='(DATA1,WORD1)'
VGET (MESSAGE) ASIS
)PROC
&KEYPRESS=.PFKEY
VPUT (DATA1 WORD1 KEYPRESS) ASIS
)END
